# 方法一:lpSolve
# 題目，求目標函數最小值(最佳解):
# C = 20 x1 + 8x2 + 10x3 +12 x4 +22 x5 +18 x6
# x1 + x2 + x3  ≤ 400
# x4 + x5 + x6  ≤ 600
# x1+ x4 ≥ 200
# x2+ x5 ≥ 300
# x3+ x6 ≥ 400
# x1 >= 0 
# x2 >= 0
# x3 >= 0
# x4 >= 0 
# x5 >= 0
# x6 >= 0

library(lpSolve)  # 載入線性規劃函式庫lpSolve
f.obj <- c(20,8,10,12,22,18) # 定義目標函數之各係數
f.con <- matrix(  # 建立限制條件之矩陣
  c(1,1,1,0,0,0,  # 第一限制式之係數
    0,0,0,1,1,1,  # 第二限制式之係數
    1,0,0,1,0,0,  # 第三限制式之係數
    0,1,0,0,1,0,  # 第四限制式之係數
    0,0,1,0,0,1,  # 第五限制式之係數
    1,0,0,0,0,0,  # 第六限制式之係數
    0,1,0,0,0,0,  # 第七限制式之係數
    0,0,1,0,0,0,  # 第八限制式之係數
    0,0,0,1,0,0,  # 第九限制式之係數
    0,0,0,0,1,0,  # 第十限制式之係數
    0,0,0,0,0,1   # 第十一限制式之係數
  ), 
  nrow = 11,  # 矩陣列數
  byrow=TRUE # 每列填滿再換列
)
# 限制條件方向(<= 小於等於， >= 大於等於)
f.dir <- c("<=","<=",">=", ">=", ">=", ">=", ">=", ">=",">=",">=",">=")
f.rhs <- c(400,600,200,300,400,0,0,0,0,0,0) # 限制條件計算式之右側數字
result <- lp(  # 使用線性規劃函式 lp求解
  direction ="min",     # 目標函數取最小值之解
  objective.in =f.obj,  # 給予上述目標函數之各係數
  const.mat =f.con,     # 給予上述限制條件之矩陣
  const.dir =f.dir,     # 給予上述限制條件方向陣
  const.rhs =f.rhs)     # 給予上述限制條件計算式之右側數字
print(result)           # 將結果印出
print(result$solution)  # 印出目標函數之各變數(即求解的x與y))
print(result$objval)    # 印出目標值(本例取最小值)
