####### 遞移矩陣有限次數的計算###############
T <-matrix(   # 建構遞移矩陣物件，函式說明請參閱附錄 A
  c(0.6,0.3,0.1,    # 3*3 矩陣資料(向量物件)
    0.4,0.3,0.3,
    0.3,0.3,0.4),
  ncol=3, 
  byrow = FALSE
)
print(T)  # a .印出遞移矩陣
X0 <- matrix(   # 建構初始計程車分布狀態
  c(0.80,0.15,0.05),
  nrow =3,
  byrow =TRUE
)
X1 <- T %*% X0
print(X1)  # b. 印出第一回的分布
X2 <- T %*% X1
print(X2)  # c. 印出第二回的分布

####### 求穩定分布解###############
A  <- matrix(  # 建構方程式(去掉redundant)各系數之矩陣
  c(1,1,1,      # 3*3 矩陣資料(向量物件)
    3,-7,3,
    1,3,-6),
  nrow=3,
  byrow=TRUE
)
print(A)  # 印出A矩陣
B <- matrix(  # 方程式等號右邊常數
  c(1,0,0),nrow=3,byrow=TRUE
)  
A1 <-solve(A)   # 求 A 之反矩陣，函式說明請參閱附錄 A
X<- A1 %*% B    # 求 本例X值  
print(X)        # 印出本例結果
